Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/primary_and_post_primary_education/teachers_and_schools/schools_inspectorate.html.txt.tmx
Source language: en
Languages: ga

source: All State primary and post-primary schools in Ireland must be inspected by the Department of Education and Skills on a regular basis
ga: Caithfidh an Roinn Oideachais agus Scileanna cigireacht a dhéanamh ar gach bunscoil agus iar-bhunscoil stáit in Éirinn ar bhonn rialta

source: The purpose of inspections is to ensure that high standards are maintained and that there is continuing development of the educational system
ga: Is í aidhm na cigireachta ná chun cinntiú go gcoinnítear le hardchaighdeáin agus go bhfuil forbairt leanúnach sa chóras oideachais

source: The Department has a special division called the Inspectorate that works to achieve these objectives
ga: Tá rannóg speisialta ag an Roinn dar teideal an Fhoireann Chigireachta a oibríonn chun na cuspóirí seo a bhaint amach

source: The legislation dealing with school inspection is the Education Act (1998) which sets out the responsibilities of the Inspectorate
ga: Is é an tAcht Oideachais 1998 an reachtaíocht a leagann síos cúraimí na Foirne Cigireachta

source: In general terms, the Inspectorate evaluates and reports on the quality of education provision and is involved in:
ga: I dtéarmaí ginearálta, déanann an Fhoireann Chigireachta measúnú agus tuairisciú ar chaighdeán an oideachais soláthraithe agus a bhfuil baint aici leis:

source: • Inspecting and evaluating the education system (particularly at primary and post-primary level)
ga: • Cigireacht agus measúnú ar an gcóras oideachais (go háirithe ag leibhéal bunscoile agus iar-bhunscoile)

source: • Giving advice to those working in the education system
ga: • Comhairle a thabhairt dóibh siúd atá ag obair sa chóras oideachais

source: • Contributing to education policy development
ga: • Páirt a ghlacadh i bhforbairt polasaí oideachais

source: The Child and Family Agency is responsible for assessing the education provision for children who are not attending a recognised school
ga: Tá an Ghníomhaireacht um Leanaí agus an Teaghlach freagrach as soláthar oideachais a mheasúnú do leanaí nach bhfuil ag freastal ar scoil aitheanta

source: This includes children who attend private schools
ga: Tá leanaí a fhreastalaíonn ar scoileanna príobháideacha san áireamh anseo

source: The Inspectorate has drawn up guidelines on monitoring this education provision for the Child and Family Agency
ga: Tá treoirlínte curtha le chéile ag an bhFoireann Chigireachta maidir le monatóireacht a dhéanamh ar an soláthar oideachais seo don Ghníomhaireacht um Leanaí agus an Teaghlach

source: Structure of the Inspectorate
ga: Struchtúr na Foirne Cigireachta

source: The Inspectorate is organised two subdivisions: Regional Services and Policy Support
ga: Tá an Fhoireann Chigireachta eagraithe ina dhá fhoroinn: Seirbhísí Réigiúnacha agus Tacaíocht Pholasaí

source: These subdivisions contain teams of inspectors, which are known as business units
ga: Cuimsíonn na foranna seo foirne de chigirí, a aithnítear mar aonaid ghnó

source: Each unit is headed by an Assistant Chief Inspector
ga: Tá gach aonad faoi stiúir ag Príomhchigire Cúnta

source: Regional Services: There are five regional units, which are responsible for monitoring the quality of schools in their respective areas
ga: Seirbhísí Réigiúnacha: Tá cúig aonad réigiúnacha, a bhfuil sé de chúram orthu monatóireacht a dhéanamh ar chaighdeán na scoileanna ina limistéir áirithe féin

source: Each unit is staffed by a team of primary- and post-primary-level inspectors who provide evaluation services (including inspections) in the region
ga: Tá gach aonad déanta suas d'fhoireann chigirí bunscoile agus iar-bhunscoile a sholáthraíonn seirbhísí measúnaithe (cigireacht ina measc) sa réigiún

source: In addition to evaluative work, inspectors provide advice and support to schools, boards of management, teachers and others in the education system
ga: I dteannta na hoibre measúnaithe, soláthraíonn na cigirí comhairle agus tacaíocht do scoileanna, boird bainistíochta, múinteoirí agus daoine eile sa chóras oideachais

source: Within the counties covered by a regional unit, primary schools are given the names and contact details of inspectors assigned to them
ga: Laistigh de na contaetha clúdaithe san aonad réigiúnach, tugtar ainmneacha agus sonraí teagmhála na gcigirí atá sannta acu do na bunscoileanna

source: Programmes of inspection and evaluation
ga: Cláir chigireachta agus measúnaithe

source: Primary schools are inspected on a cyclical basis in line with annual inspection targets
ga: Déantar cigireacht ar Bhunscoileanna ar bhonn timthriallach de réir na spriocanna bliantúla cigireachta

source: A school report (Tuairisc Scoile) is prepared on each primary school on average every seven years following a detailed school inspection
ga: Réitítear Tuairisc Scoile ar gach bunscoil gach seacht mbliana ar an meán tar éis cigireacht mionsonraithe scoile

source: This report is passed on to the school staff and boards of management
ga: Seoltar an tuairisc seo ar aghaidh chuig foireann na scoile agus chuig na boird bainistíochta

source: This evaluation of the school examines all aspects of teaching, learning and assessment, as well as school planning, the work of the board of management, and the school's accommodation and resources
ga: Déanann measúnú seo na scoile scrúdú ar ghnéithe uilig na múinteoireachta, na foghlama agus an mheasúnaithe, chomh maith le pleanáil scoile, obair an bhoird bainistíochta agus cóiríocht agus acmhainní na scoile

source: The work of individual teachers is inspected in accordance with the Rules for National Schools and much of this work will relate to the evaluation and support of probationary teachers
ga: Déantar cigireacht ar obair na múinteoirí aonair de réir na Rialacha do Scoileanna Náisiúnta agus bainfidh mórán den obair seo le measúnú agus tacaíocht i leith na múinteoirí promhaidh

source: Inspectors also carry out frequent incidental inspection visits to schools to familiarise themselves with the ongoing work of particular schools and teachers
ga: Déanann cigirí cuairteanna cigireachta teagmhasacha go rialta chun dul i dtaithí ar obair leanúnach scoileanna agus múinteoirí áirithe

source: The inspection of primary schools is being further developed with the introduction of Whole School Evaluation (see below) which will replace the Tuairisc Scoile model of inspection
ga: Tá cigireacht na mbunscoileanna á forbairt a thuilleadh le Measúnú Iomlán Scoile á thabhairt isteach (féach thíos) a thiocfaidh in áit samhail cigireachta an Tuairisc Scoile

source: Specialist inspectors undertake subject inspections in post-primary schools
ga: Tugann sainchigirí faoi chigireacht ábhair in iar-bhunscoileanna

source: An evaluation report on the teaching of a particular subject is given to the school
ga: Tugtar tuairisc mheasúnaithe ar mhúinteoireacht i leith ábhair áirithe don scoil

source: Inspectors may also visit schools in a number of other contexts, for example, the monitoring of special programmes that may be in place in that particular school
ga: D'fhéadfadh cigirí cuairt a thabhairt ar scoileanna i gcomhthéacsanna eile, mar shampla, monatóireacht ar chláir speisialta a d'fhéadfadh a bheith i bhfeidhm i scoileanna áirithe

source: Whole School Evaluation (see below) has been introduced to secondary schools to complement other types of inspection
ga: Measúnú Iomlán Scoile (féach thíos) atá tugtha isteach in iar-bhunscoileanna chun cineálacha eile cigireachta a chomhlánú

source: Until March 2003 much of the work of the post-primary inspectors was the organisation of the Junior and Leaving Certificate examinations
ga: Go dtí Márta 2003, eagrú scrúduithe an Teastais Shóisearaigh agus na hArdteiste a bhí mar mhórchuid d'obair na gcigirí iar-bhunscoile

source: This is now being done by the State Examinations Commission which publishes the Chief Examiners' reports on the outcomes of the examinations in a number of subjects
ga: Tá sé seo anois á dhéanamh ag Coimisiún na Scrúduithe Stáit a fhoilsíonn tuairiscí na bPríomhscrúdaitheorí ar thorthaí na scrúduithe i líon ábhar

source: These reports give schools and teachers detailed information on how students have performed in each part of the examination in a given subject
ga: Tugann na tuairiscí seo eolas sonraithe do scoileanna agus do mhúinteoirí ar conas mar ar éirigh le daltaí i ngach cuid den scrúdú in ábhar ar leith

source: The Inspectorate is also responsible for evaluating certain types of educational provision
ga: Tá sé de chúram ag an bhFoireann Chigireachta freisin measúnú a dhéanamh ar chineálacha áirithe soláthar oideachais

source: In addition, the Child and Family Agency under the Education Welfare Act 2000 may ask the Inspectorate to assess the education provided in places other than recognised schools
ga: Ina theannta sin, d'fhéadfadh an Ghníomhaireacht um Leanaí agus an Teaghlach faoin Acht Oideachais (Leas) 2000iarraidh ar an bhFoireann Chigireachta measúnú a dhéanamh ar an oideachas a chuirtear ar fáil in áiteanna nach scoileanna aitheanta iad

source: These assessments may assist the Agency to decide if children in non-recognised schools are receiving an appropriate minimum education
ga: D'fhéadfadh na measúnuithe seo cuidiú leis an Ghníomhaireacht um Leanaí agus an Teaghlach chun cinneadh a dhéanamh an bhfuil leanaí i scoileanna neamhaitheanta ag fáil íosleibhéal oideachais iomchuí

source: Since 2003-2004 this type of evaluation has been phased into primary and post-primary schools
ga: Ó 2003-2004 tá an cineál measúnaithe seo curtha i bhfeidhm de réir a chéile i mbunscoileanna agus in iar-bhunscoileanna

source: It aims to improve schools and complements school inspections
ga: Díríonn sé ar scoileanna a fheabhsú agus déanann sé cigireacht scoile a chomhlánú

source: The WSE has been developed using a partnership approach and it is designed to:
ga: Forbraíodh Measúnú Iomlán Scoile ag úsáid cur chuige comhpháirtíochta agus tá sé deartha chun:

source: • Allow the whole school community to participate in the evaluation
ga: • Ceadú don bpobal iomlán scoile páirt a ghlacadh sa mheasúnú

source: • Affirm good practice in schools and provide advice and support
ga: • Cleachtas maith a dhearbhú sna scoileanna agus comhairle agus tacaíocht a sholáthar

source: • Ensure school accountability by providing reliable data on the operation of the school
ga: • Cuntasacht scoile a chinntiú trí shonraí iontaofa a sholáthar ar oibríocht na scoile

source: • Enable teachers and schools to use the evaluation criteria for school self-review
ga: • Múinteoirí agus scoileanna a chumasú chun na critéir measúnaithe a úsáid le haghaidh féin-bhreithniú na scoile

source: • Provide information to contribute to development of education policies
ga: • Eolas a sholáthar a chuirfidh le forbairt ar bheartais oideachais

source: The WSE evaluates schools under the headings of management, planning, curriculum provision, learning and teaching, and support for students
ga: Déanann Measúnú Iomlán Scoile measúnú ar scoileanna faoi na ceannteidil seo a leanas: bainistíocht, pleanáil, soláthar curaclaim, foghlaim agus múinteoireacht, agus tacaíocht do dhaltaí

source: The WSE process includes pre-evaluation meetings with staff and management, meeting with parents’ association, school and classroom visits, preparation of a draft report, post-inspection meetings with staff and management, finalisation of the WSE report and issue of report to school
ga: Cuimsíonn próiseas an Measúnaithe Iomlán Scoile cruinnithe réamh-mheasúnaithe leis an bhfoireann teagaisc agus leis an mbainistíocht, cruinniú le cumann na dtuismitheoirí, cuairteanna scoile agus ranga, ullmhúchán dréacht-thuairisce, cruinnithe iar-chigireachta leis an bhfoireann agus leis an mbainistíocht, críochnú na tuairisce um Measúnú Iomlán Scoile agus eisiúint na tuairisce chuig an scoil

source: The Evaluation Support and Research Unit (ESRU) of the Inspectorate is responsible for evaluating aspects of education provision throught thematic or programme evaluations
ga: Tá sé de chúram ag an Aonad Taighde agus Tacaíochta ar Mheasúnú den bhFoireann Chigireachta measúnú a dhéanamh ar ghnéithe den soláthar oideachais trí mheasúnuithe téamacha agus cláir

source: At post-primary level these include Transition Year, Leaving Certificate Vocational Programme, Leaving Certificate Applied and the Junior Certificate School Programme
ga: Ag leibhéal iar-bhunscoile cuimsíonn siad seo an Idirbhliain, Gairmchlár na hArdteistiméireachta, an Ardteistiméireacht Fheidhmeach agus Clár Scoile an Teastais Shóisearaigh

source: The success of these programmes has been evaluated and the Inspectorate has published reports giving full details of its findings
ga: Tá rathúlacht na gclár seo measúnaithe agus tá an Fhoireann Chigireachta tar éis tuairiscí a fhoilsiú le sonraí iomlána faoina dtorthaí

source: You can contact the Inspectorate for details of how to get copies of these reports
ga: Is féidir leat teagmháil a dhéanamh leis an bhFoireann Chigireachta chun sonraí a fháil ar conas cóipeanna den tuairisc a fháil

source: At primary level, evaluations carried out include, for example, provision for Traveller education; implementation of the primary school curriculum; literacy and numeracy in schools designated as disadvantaged
ga: Ag leibhéal bunscoile, cuimsíonn cuid de na measúnuithe a rinneadh, mar shampla, soláthar d'oiliúint na dTaistealaithe; cur i bhfeidhm curaclaim na bunscoile; litearthacht agus uimhríocht i scoileanna a aithnítear a bheith faoi mhíbhuntáiste

source: Since 2003 the Inspectorate’s role in the provision of resources for pupils with special educational needs has greatly reduced
ga: Ó 2003, tá ról na Foirne Cigireachta i soláthar na n-acmhainní do dhaltaí le riachtanais speisialta oideachais laghdaithe go mór

source: This work is now done by the National Council for Special Education
ga: Tá an obair seo anois á dhéanamh ag an gComhairle Náisiúnta um Oideachas Speisialta

source: The Inspectorate continues to evaluate the services for pupils with special educational needs
ga: Leanann an Fhoireann Chigireachta de bheith ag measúnú na seirbhísí do dhaltaí le riachtanais speisialta oideachais

source: Policy development and review
ga: Forbairt beartas agus athbhreithniú

source: Curriculum development: The Inspectorate contributes to curriculum and syllabus development by representing the Department of Education and Skills on the primary and post-primary committees of the National Council for Curriculum and Assessment (NCCA)
ga: Forbairt curaclaim: Cuireann an Fhoireann Chigireachta le forbairt curaclaim agus siollabais trí ionadaíocht a dhéanamh don Roinn Oideachais agus Scileanna ar choistí bunscolaíochta agus iar-bhunscolaíochta na Comhairle Náisiúnta Curaclaim agus Measúnachta

source: In-career development of teachers: The Department of Education and Skills funds a wide range of initiatives that assist teachers to improve their managerial and teaching skills
ga: Forbairt ionghairme múinteoirí: Déanann an Roinn Oideachais agus Scileanna réimse leathan tionscnaimh a mhaoiniú a chuidíonn le múinteoirí a scileanna bainistíochta agus múinteoireachta féin a fheabhsú

source: The Inspectorate contributes by helping to identify priorities for in-career development programmes and by monitoring the quality of the courses delivered to teachers
ga: Cuireann an Fhoireann Chigireachta le cúrsaí trí chabhrú le tosaíochtaí a aithint do chláir forbartha ionghairme agus trí mhonatóireacht a dhéanamh ar chaighdeán na gcúrsaí atá á soláthar ag múinteoirí

source: Monitoring teacher education/teacher accreditation: In addition to their work with probationary teachers, inspectors in the primary sector also monitor the standards of student teachers as they complete their undergraduate studies
ga: Monatóireacht ar oideachas an mhúinteora/creidiúnú an mhúinteora: I dteannta a gcuid oibre le múinteoirí promhaidh, déanann cigirí sa rannóg bunscolaíochta monatóireacht ar chaighdeáin na múinteoirí faoi oiliúint agus iad ag comhlíonadh a gcuid staidéir bunchéime

source: At present, members of the Inspectorate are involved in the accreditation process for teachers at primary and post-primary levels
ga: I láthair na huaire, tá baill den Fhoireann Chigireachta bainteach leis an bpróiseas creidiúnaithe do mhúinteoirí ag leibhéil bunscoile agus iar-bhunscoile

source: At second level much of the Inspectorate’s work advising on qualifications and accreditation of teachers is being transferred to the Teaching Council which was established in 2006 under the Teaching Council Acts 2001 and 2006
ga: Ag an dara leibhéal tá mórán d'obair chomhairleach na Foirne Cigireachta ar cháilíochtaí agus creidiúnú á aistriú chuig an gComhairle Mhúinteorachta a bunaíodh i 2006 faoi na hAchtanna um Chomhairle Mhúinteorachta 2001 agus 2006

source: School self-review and school development planning The Inspectorate promotes the development of school self-review and development planning processes both within schools and through its involvement in the School Development Planning Initiative at primary and second levels
ga: Féin-bhreithniú scoile agus pleanáil forbartha scoile: Cuireann an Fhoireann Chigireachta forbairt chun cinn i leith próisis féin-bhreithnithe scoile agus pleanála forbartha scoile, laistigh de scoileanna agus trína baint leis an Tionscnamh Pleanála Forbartha Scoile ag leibhéil bunscoile agus iar-bhunscoile

source: Inspectors contribute very significantly in supporting the provision of targeted educational services for pupils with special needs at first and second levels
ga: Cuireann cigirí go mór le tacaíocht i dtaobh soláthar seirbhísí sonraithe oideachais do dhaltaí le riachtanais speisialta ag an gcéad agus ag an dara leibhéal

source: Disadvantage and social inclusion
ga: Míbhuntáiste agus cuimsiú sóisialta

source: The Inspectorate has a central role in planning, managing and overseeing educational input into a wide range of initiatives designed to deal with educational disadvantage and to promote social inclusion
ga: Tá ról lárnach ag an bhFoireann Chigireachta i bpleanáil, i mbainistíocht agus maoirsiú an ionchuir oideachais i réimse leathan tionscnaimh atá deartha chun déileáil le míbhuntáiste oideachais agus chun cuimsiú sóisialta a chur chun cinn

source: They place a particular emphasis on school retention and home-school links and in supporting developments in educational provision for Travellers and for foreign nationals
ga: Leagann siad béim áirithe ar choinneáil scoile agus naisc bhaile-scoile agus i dtacú le forbairtí i soláthar an oideachais do Thaistealaithe agus neamhnáisiúnaigh

source: Wider linkages: The Inspectorate participates in and contributes to the work of relevant North/South educational initiatives and various EU and other international organisations
ga: Naisc níos leithne: Glacann an Fhoireann Chigireachta páirt agus cuireann siad le hobair na dtionscnamh oideachais ábhartha Thuaidh/Theas agus AE chomh maith le heagraíochtaí idirnáisiúnta

source: A key element of this work is its involvement in international surveys of student attainment
ga: Ceann de phríomheilimintí na hoibre seo ná a mbaint le suirbhéanna idirnáisiúnta maidir le gnóthachtáil na ndaltaí

source: Planning and building: Inspectors attached to the Planning and Building units of the Department of Education and Skills provide specialist support and advice on matters associated with educational buildings
ga: Pleanáil agus tógáil: Soláthraíonn na Cigirí atá bainteach le haonaid Phleanála agus Tógála na Roinne Oideachais agus Scileanna saintacaíocht agus comhairle ar cheisteanna a bhaineann le foirgnimh oideachais

source: The Professional Code of Practice on Evaluation and Reporting for the Inspectorate sets out general principles and guidelines that inspectors use for evaluation and reporting
ga: Leagann an Cód Cleachtais Proifisiúnta ar Mheasúnú agus Thuairisciú don bhFoireann Chigireachta amach prionsabail agus treoirlínte ginearálta a úsáideann cigirí chun measúnú agus tuairisciú a dhéanamh

source: The guidelines apply equally to evaluating and reporting on the work of schools as units, on individual teachers, on curricular programmes and on the implementation of Ministerial regulations, carried out by inspectors working individually or in teams
ga: Baineann na treoirlínte ar an mbealach céanna le measúnú agus tuairisciú ar obair na scoileanna mar aonaid, ar mhúinteoirí aonair, ar chláir churaclaim agus ar chur i bhfeidhm rialacháin na n-Airí, comhlíonta ag cigirí ag obair ina n-aonar nó i bhfoirne

source: Reports of schools inspections carried out since 6 February 2006 are made available to the public
ga: Tá na tuairiscí cigireachta scoile a rinneadh tar éis 6 Feabhra 2006 á gcur ar fáil don bpobal

source: These inspection reports are published according to the Inspectorate’s Guidelines on the Publication of School Reports and do not include details of examination results
ga: Foilsítear na tuairiscí cigireachta seo de réir Treoirlínte ar Fhoilsiú na dTuairiscí Scoile (pdf) na Foirne Cigireachta agus ní chuimsíonn siad sonraí maidir le torthaí scrúduithe

source: The inspection report is first sent to the school which has the right to respond to the Inspectorate’s report within 21 days
ga: Seoltar tuairisc an chigire chuig an scoil i dtosach agus tá sé de cheart acu freagra a thabhairt ar thuairisc na Foirne Cigireachta laistigh de 21 lá

source: The Inspectorate will then publish the report and the school’s response
ga: Foilseoidh an Fhoireann Chigireachta an tuairisc ansin agus freagra na scoile

source: Reports of school inspections carried out before 6 February 2006 are not generally available to the public
ga: Níl na tuairiscí cigireachta scoile a rinneadh roimh 6

source: may be given at the discretion of the school
ga: Cibé ar bith, d'fhéadfaí rochtain a thabhairt faoi rogha na scoile

source: The reports of school inspections carried out after 6 February 2006 are published on the Department of Education and Skills (DES) website
ga: Tá na tuairiscí cigireachta scoile a rinneadh tar éis 6 Feabhra 2006 foilsithe ar shuíomh gréasáin na Roinne Oideachais agus Scileanna (ROS)

source: You can read more about the inspection of schools on the DES website
ga: Leigh tuilleadh eolais faoi chigireacht ar scoileanna ar láithreán gréasáin ROS
